'''
接收用户输入的生日，判断用户的星座
("水瓶座","双鱼座","白羊座","金牛座","双子座","巨蟹座","狮子座","处女座","天秤座","天蝎座","射手座","摩羯座")
((1,20),(2,19),(3,21),(4,20),(5,21),(6,22),(7,23),(8,23),(9,23),(10,24),(11,23),(12,22))
'''

zodiac = ("摩羯座","水瓶座","双鱼座","白羊座","金牛座","双子座","巨蟹座","狮子座","处女座","天秤座","天蝎座","射手座")
zodiac_days = ((1,20),(2,19),(3,21),(4,20),(5,21),(6,22),(7,23),(8,23),(9,23),(10,24),(11,23),(12,22))

month = int(input("请输入您的出生月份:"))
day = int(input("请输入您的出生日期:"))

index = 0
for zodiac_day in zodiac_days:
    if month==12 and day>22:
        index = 0
    elif (month,day) > zodiac_day:
        index += 1

print(zodiac[index])